yblpoi/ai-passport/sdkconfig.defaults
# --- 目标芯片 ---
CONFIG_IDF_TARGET="esp32c3"
# 注:ESP32-C3 无 PSRAM,故不设 CONFIG_SPIRAM。

# --- Flash ---
# FoloToy AI Passport 当前产品/固件基线使用 8MB Flash。
CONFIG_ESPTOOLPY_FLASHSIZE_8MB=y
# 固定 8MB 镜像头，关闭 detect，便于 idf.py merge-bin。
CONFIG_ESPTOOLPY_HEADER_FLASHSIZE_UPDATE=n
# 默认模板只保留 NVS、PHY data 和占用剩余空间的 factory app；用户可按需修改。
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"
CONFIG_PARTITION_TABLE_FILENAME="partitions.csv"

# --- 控制台:USB-Serial-JTAG(C3 原生 USB,GPIO18/19)---
# 不用 UART0:其默认 TX=GPIO21 与本板背光引脚冲突。
CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG=y
CONFIG_ESP_CONSOLE_SECONDARY_NONE=y

# --- LVGL ---
# 界面大数字用的是像素字体 love_font_36(main/love_app.c),Montserrat 只用于
# 纯 ASCII 的 demo 页与像素字体的 fallback,所以只开 14/20 两档。
CONFIG_LV_COLOR_DEPTH_16=y
CONFIG_LV_FONT_MONTSERRAT_14=y
CONFIG_LV_FONT_MONTSERRAT_20=y
# LVGL 内置 malloc 池大小(KB)。它是独立静态区、不与系统堆共享,配大了会白白占用 RAM。
# 只画纯色块、标签和 4bpp 图标,对象数量很少;历史上为了 demo 菜单的卡片墙 + 吉祥物
# 调到 32KB,那些页面已随 demo 子系统删除。
# 注意这块是从系统堆里切走的:调大会挤掉 Wi-Fi/BLE/HTTP 的余量。
#
# 从 24KB 降到 18KB 是为了给系统堆腾出更大的一块连续可用内存,这是后台网页
# 打不开的根因:实测传大响应时,失败瞬间"最大连续块"只有 1216~1408 字节,
# 而 Wi-Fi 驱动发一帧需要约 1600 字节连续内存 —— 分不到就发不出帧,客户端不 ACK,
# lwIP 的 send() 一直阻塞到超时。症状很有迷惑性:1KB 以下的小响应毫秒级正常,
# 重启后第一个大响应也能过,之后下行就永久死掉(手机和电脑都一样,只能重启恢复)。
# 降到 18KB 后堆从 13.8KB 变成 20.0KB、最大连续块 11776 字节,问题消失。
# 界面只用 lv_obj / lv_label / lv_image 与 flex 布局,18KB 够用;若出现控件创建
# 失败(界面缺元素或断言),再往上调回一些。
CONFIG_LV_MEM_SIZE_KILOBYTES=18

# LVGL 的 examples/ 与 demos/ 默认参与编译,但产品固件不需要它们:
# 编进去只会拖慢构建,而且 examples 里用到 slider/button 等控件,会与下面的
# 控件裁剪互相牵制(关掉控件后 examples 直接编译失败)。一并关闭。
CONFIG_LV_BUILD_EXAMPLES=n
CONFIG_LV_BUILD_DEMOS=n

# LVGL 控件裁剪:界面只用 lv_obj / lv_label / lv_image 与 flex 布局# (main/ui_pixel.c、main/love_app.c、main/main.c),其余控件全部未引用。
# 每个控件的 .c 都有 "#if LV_USE_X != 0" 守卫,关闭后会编译成空单元;
# lv_theme_default 对它们的引用也都在 "#if LV_USE_X" 内,所以可以整批关掉。
# 注意 SLIDER/SPINNER/SCALE 分别以 BAR/ARC/LINE 为基类,必须连同基类一起关。
# 刻意保留:OBJ/LABEL/IMAGE(在用)、FLEX(在用)、DRAW_SW、THEME_DEFAULT、
# BUILTIN_*、ASSERT_*、FONT_PLACEHOLDER(字体兜底)与 OBSERVER。
CONFIG_LV_USE_ANIMIMG=n
CONFIG_LV_USE_ARC=n
CONFIG_LV_USE_ARCLABEL=n
CONFIG_LV_USE_BAR=n
CONFIG_LV_USE_BUTTON=n
CONFIG_LV_USE_BUTTONMATRIX=n
CONFIG_LV_USE_CALENDAR=n
CONFIG_LV_USE_CANVAS=n
CONFIG_LV_USE_CHART=n
CONFIG_LV_USE_CHECKBOX=n
CONFIG_LV_USE_DROPDOWN=n
CONFIG_LV_USE_GRID=n
CONFIG_LV_USE_IMAGEBUTTON=n
CONFIG_LV_USE_KEYBOARD=n
CONFIG_LV_USE_LED=n
CONFIG_LV_USE_LINE=n
CONFIG_LV_USE_LIST=n
CONFIG_LV_USE_MENU=n
CONFIG_LV_USE_MSGBOX=n
CONFIG_LV_USE_ROLLER=n
CONFIG_LV_USE_SCALE=n
CONFIG_LV_USE_SLIDER=n
CONFIG_LV_USE_SPAN=n
CONFIG_LV_USE_SPINBOX=n
CONFIG_LV_USE_SPINNER=n
CONFIG_LV_USE_SWITCH=n
CONFIG_LV_USE_TABLE=n
CONFIG_LV_USE_TABVIEW=n
CONFIG_LV_USE_TEXTAREA=n
CONFIG_LV_USE_TILEVIEW=n
CONFIG_LV_USE_WIN=n
# 默认主题已启用,lv_theme_simple 在 lv_display.c 里属于 "#elif" 死分支。
CONFIG_LV_USE_THEME_SIMPLE=n

# --- 系统 ---
CONFIG_FREERTOS_HZ=1000

# --- 电源管理 ---
# 只服务于**手动浅睡**(状态页那条"浅睡眠"与串口 `sleep light`):没有它
# esp_light_sleep_start() 会直接返回 ESP_ERR_INVALID_STATE(实测)。
# 空闲路径走的是深睡,不需要它,也不靠它。
# 注意:FREERTOS_USE_TICKLESS_IDLE 默认仍是关的,也就是说**不会**全系统自动浅睡 ——
# 本固件只在明确请求时调 esp_light_sleep_start(),这样时序最容易预测。
CONFIG_PM_ENABLE=y
# 浅睡时**不要**给 CPU 域断电:`CONFIG_PM_POWER_DOWN_CPU_IN_LIGHT_SLEEP=y`(默认)会把
# 数字 GPIO 域一起关掉,于是"按键唤醒浅睡"配不上 —— 实测 esp_light_sleep_start() 直接
# 返回 ESP_ERR_INVALID_STATE(数字 GPIO 中断没了,唤醒源无效)。关掉它以后 CPU 域保持供电,
# 浅睡的静态电流高一些,但换来按键能可靠唤醒(而且不重启)。
# CONFIG_PM_POWER_DOWN_CPU_IN_LIGHT_SLEEP is not set

# 深睡的按键唤醒要靠**板上的外部 10k 上拉**把 GPIO0 抬到高电平(三个键按下时该节点是
# 0/300/595 mV,所以配的是低电平唤醒)。这一项默认是 y,IDF 会在入睡前按唤醒电平再给
# 这个脚**自动加一层内部上下拉**(esp_hw_support/sleep_modes.c 的
# gpio_deep_sleep_wakeup_prepare),与板上的外部电阻叠加 —— esp_sleep.h 对这种情况有
# 明文警告("when using external pull-up or pull-down resistors, please be sure to
# disable the ESP_SLEEP_GPIO_ENABLE_INTERNAL_RESISTORS option, as the combination of
# internal and external resistors may cause interference")。
# 症状正是我们踩过的:只要武装按键唤醒,设备就在深睡 2~30 秒后**自己醒来**(黑屏秒醒)。
# 关掉它,外部上拉说了算。
CONFIG_ESP_SLEEP_GPIO_ENABLE_INTERNAL_RESISTORS=n

# --- 编译器 ---
# 按体积优化(-Os)。ESP-IDF 默认按调试优化(-Og),会让 app 镜像明显偏大;
# 本项目的瓶颈在 SPI 刷屏与 I2S DMA,不在 CPU,所以 -Os 不会影响观感与时序。
# 断言级别保持默认(ENABLE),不要改成 DISABLE —— 那会把 assert() 变成空操作。
CONFIG_COMPILER_OPTIMIZATION_SIZE=y

# --- SNTP ---
# 设备没有 RTC，时间只能靠网络拿回来，所以配两个服务器做容错。
# 该选项同时决定 esp_sntp_config_t.servers[] 的长度：保持 1 会让第二个
# 服务器在编译期被静默丢弃（excess elements in array initializer）。
CONFIG_LWIP_SNTP_MAX_SERVERS=2

# --- Bluetooth LE / NimBLE ---
# ESP32-C3 仅支持 BLE；示例只启用单连接 peripheral 所需的最小 host 配置。
CONFIG_BT_ENABLED=y
CONFIG_BT_NIMBLE_ENABLED=y
CONFIG_BT_NIMBLE_ROLE_CENTRAL=n
CONFIG_BT_NIMBLE_ROLE_PERIPHERAL=y
CONFIG_BT_NIMBLE_ROLE_BROADCASTER=y
CONFIG_BT_NIMBLE_ROLE_OBSERVER=n
CONFIG_BT_NIMBLE_MAX_CONNECTIONS=1
CONFIG_BT_NIMBLE_HOST_BASED_PRIVACY=n
CONFIG_BT_NIMBLE_NVS_PERSIST=n

# BLE 一旦打开就吃掉约 65 KB 堆(实测:79,212 → 12,784 字节),而本机只要
# "广播 + 一条连接 + 若干条串口命令"这点流量 —— 默认的缓冲池是按多连接、
# 批量吞吐给的,严重超配。两轮收下来:
#   MSYS_2 是主机侧待发 ACL 数据,24×320B → 8×320B → 6×320B
#   ACL_FROM_LL 是从控制器上行的 ACL 缓冲,24×255B → 8×255B → 6×255B
#   EVT 是控制器事件缓冲,30×70B → 12×70B → 8×70B
# 省下来的堆直接决定"蓝牙开着时后台网页还能不能传大文件"。
# 第一轮之后实测 12,784 → 28,224 字节(最大连续块 7,680 → 20,480),页面已能工作。
CONFIG_BT_NIMBLE_MSYS_2_BLOCK_COUNT=6
CONFIG_BT_NIMBLE_TRANSPORT_ACL_FROM_LL_COUNT=6
CONFIG_BT_NIMBLE_TRANSPORT_EVT_COUNT=8

# 刻意**不动** MSYS_1(12×256B):串口控制台的输出走 ble_hs_mbuf_from_flat()
# 从 MSYS_1 取块,裁小会在手机读得慢时丢字。

# NimBLE host 任务栈。曾按 IDF 默认往下裁到 3072,真机上用 `status` 读
# nimble_host 的 uxTaskGetStackHighWaterMark 发现**只剩 516 字节余量**(栈深 3072),
# 偏薄:配对、长写、MTU 交换这些路径都可能比实测那条更深。省 1KB 不值得冒栈溢出的
# 风险,写回默认值并显式留在这里,免得再被"顺手裁一刀"。
CONFIG_BT_NIMBLE_HOST_TASK_STACK_SIZE=4096

# 控制器侧:6 个并发 BLE 活动我们只用得上 2 个(一个广播集 + 一条连接)。
# 广播上报缓冲是给扫描用的,而设备从不做 BLE 扫描(附近 Wi-Fi 扫描走的是 Wi-Fi),
# 但 Kconfig 的下限就是 50,填 10 会被静默忽略并回落到默认 100(实测构建日志里有
# "user value 10 ... outside the active range ([50, 1000])")。50 × 35B 已是能取的最小值。
CONFIG_BT_CTRL_BLE_MAX_ACT=2
CONFIG_BT_CTRL_BLE_ADV_REPORT_FLOW_CTRL_NUM=50
